arduino/portentax8-stm32h7-fw/src/can.c
/* mbed Microcontroller Library
 * Copyright (c) 2006-2017 ARM Limited
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/**************************************************************************************
 * INCLUDE
 **************************************************************************************/

#include "main.h"
#include <stdbool.h>
#include <string.h>
#include <stdio.h>
#include "can_api.h"
#include "stm32h7xx_ll_hsem.h"
#include "system.h"
#include "peripherals.h"

/**************************************************************************************
 * DEFINE
 **************************************************************************************/

#define TARGET_STM32H7      1
#define CFG_HW_RCC_SEMID    3
#undef DUAL_CORE

#define X8H7_CAN_STS_FLG_RX_OVR  0x01  // Receive Buffer Overflow
#define X8H7_CAN_STS_FLG_TX_BO   0x02  // Bus-Off
#define X8H7_CAN_STS_FLG_TX_EP   0x04  // Transmit Error-Passive
#define X8H7_CAN_STS_FLG_RX_EP   0x08  // Receive Error-Passive
#define X8H7_CAN_STS_FLG_TX_WAR  0x10  // Transmit Error Warning
#define X8H7_CAN_STS_FLG_RX_WAR  0x20  // Receive Error Warning
#define X8H7_CAN_STS_FLG_EWARN   0x40  // Error Warning
#define X8H7_CAN_STS_FLG_TX_OVR  0x80  // Transmit Buffer Overflow

#define X8H7_CAN_STS_INT_TX      0x01
#define X8H7_CAN_STS_INT_RX      0x02
#define X8H7_CAN_STS_INT_ERR     0x04

/**************************************************************************************
 * GLOBAL VARIABLES
 **************************************************************************************/

FDCAN_HandleTypeDef hfdcan1;
FDCAN_HandleTypeDef hfdcan2;

can_t fdcan_1;
can_t fdcan_2;

static uintptr_t can_irq_contexts[2] = {0};
static can_irq_handler irq_handler;

/**************************************************************************************
 * FUNCTION DEFINITION
 **************************************************************************************/

static uint32_t HAL_RCC_FDCAN_CLK_ENABLED = 0;

/**
 * @brief FDCAN MSP Initialization
 * This function configures the hardware resources used in this example
 * @param hfdcan: FDCAN handle pointer
 * @retval None
 */
void HAL_FDCAN_MspInit(FDCAN_HandleTypeDef *hfdcan) {
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  if (hfdcan->Instance == FDCAN1) {
    /* USER CODE BEGIN FDCAN1_MspInit 0 */

    /* USER CODE END FDCAN1_MspInit 0 */
    /* Peripheral clock enable */

    /*
    HAL_RCC_FDCAN_CLK_ENABLED++;
    if (HAL_RCC_FDCAN_CLK_ENABLED == 1) {
      __HAL_RCC_FDCAN_CLK_ENABLE();
    }
    */

    __HAL_RCC_GPIOD_CLK_ENABLE();
    /**FDCAN1 GPIO Configuration
    PD1     ------> FDCAN1_TX
    PD0     ------> FDCAN1_RX
    */
    GPIO_InitStruct.Pin = GPIO_PIN_1 | GPIO_PIN_0;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF9_FDCAN1;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

    /* FDCAN1 interrupt Init */
    HAL_NVIC_SetPriority(FDCAN1_IT0_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(FDCAN1_IT0_IRQn);
    /* USER CODE BEGIN FDCAN1_MspInit 1 */

    /* USER CODE END FDCAN1_MspInit 1 */
  } else if (hfdcan->Instance == FDCAN2) {
    /* USER CODE BEGIN FDCAN2_MspInit 0 */

    /* USER CODE END FDCAN2_MspInit 0 */
    /* Peripheral clock enable */
    #if 0
    HAL_RCC_FDCAN_CLK_ENABLED++;
    if (HAL_RCC_FDCAN_CLK_ENABLED == 1) {
      __HAL_RCC_FDCAN_CLK_ENABLE();
    }
    #endif

    __HAL_RCC_GPIOB_CLK_ENABLE();
    /**FDCAN2 GPIO Configuration
    PB5     ------> FDCAN2_RX
    PB6     ------> FDCAN2_TX
    */
    GPIO_InitStruct.Pin = GPIO_PIN_5 | GPIO_PIN_6;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF9_FDCAN2;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* FDCAN2 interrupt Init */
    HAL_NVIC_SetPriority(FDCAN2_IT0_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(FDCAN2_IT0_IRQn);
    /* USER CODE BEGIN FDCAN2_MspInit 1 */

    /* USER CODE END FDCAN2_MspInit 1 */
  }
}

/**
 * @brief FDCAN MSP De-Initialization
 * This function freeze the hardware resources used in this example
 * @param hfdcan: FDCAN handle pointer
 * @retval None
 */
void HAL_FDCAN_MspDeInit(FDCAN_HandleTypeDef *hfdcan) {
  if (hfdcan->Instance == FDCAN1) {
    /* USER CODE BEGIN FDCAN1_MspDeInit 0 */

    /* USER CODE END FDCAN1_MspDeInit 0 */
    /* Peripheral clock disable */
    HAL_RCC_FDCAN_CLK_ENABLED--;
    if (HAL_RCC_FDCAN_CLK_ENABLED == 0) {
      __HAL_RCC_FDCAN_CLK_DISABLE();
    }

    /**FDCAN1 GPIO Configuration
    PD1     ------> FDCAN1_TX
    PD0     ------> FDCAN1_RX
    */
    HAL_GPIO_DeInit(GPIOD, GPIO_PIN_1 | GPIO_PIN_0);

    /* FDCAN1 interrupt DeInit */
    HAL_NVIC_DisableIRQ(FDCAN1_IT0_IRQn);
    /* USER CODE BEGIN FDCAN1_MspDeInit 1 */

    /* USER CODE END FDCAN1_MspDeInit 1 */
  } else if (hfdcan->Instance == FDCAN2) {
    /* USER CODE BEGIN FDCAN2_MspDeInit 0 */

    /* USER CODE END FDCAN2_MspDeInit 0 */
    /* Peripheral clock disable */
    HAL_RCC_FDCAN_CLK_ENABLED--;
    if (HAL_RCC_FDCAN_CLK_ENABLED == 0) {
      __HAL_RCC_FDCAN_CLK_DISABLE();
    }

    /**FDCAN2 GPIO Configuration
    PB5     ------> FDCAN2_RX
    PB6     ------> FDCAN2_TX
    */
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_5 | GPIO_PIN_6);

    /* FDCAN2 interrupt DeInit */
    HAL_NVIC_DisableIRQ(FDCAN2_IT0_IRQn);
    /* USER CODE BEGIN FDCAN2_MspDeInit 1 */

    /* USER CODE END FDCAN2_MspDeInit 1 */
  }
}


static void error(char* string) {
    printf(string);
    while (1);
}

void fdcan1_handler(uint8_t opcode, uint8_t *data, uint16_t size) {
    if (opcode == CONFIGURE)
    {
      uint32_t const can_bitrate = *((uint32_t *)data);
      can_frequency(&fdcan_1, can_bitrate);
      dbg_printf("fdcan1_handler: configuring fdcan1 with frequency %ld\n", can_bitrate);
    }
    else if (opcode == CAN_FILTER)
    {
      uint32_t const * info = (uint32_t*)data;

      uint32_t const handle = info[0];
      uint32_t const id     = info[1];
      uint32_t const mask   = info[2];

      CANFormat const format = (id < 0x800) ? CANStandard : CANExtended;

      if (!can_filter(&fdcan_1, id, mask, format, handle)) {
        dbg_printf("fdcan1_handler: can_filter failed for id: %ld, mask: %ld, format: %d, handle %ld\n", id, mask, format, handle);
      }
    }
    else if (opcode == CAN_TX_FRAME) {
        CAN_Message msg;
        msg.type = CANData;
        msg.format = CANStandard;
        memcpy(&msg, data, size);

        dbg_printf("Sending CAN message to %x, size %d, content[0]=0x%02X\n",
        msg.id, msg.len, msg.data[0]);

        if (msg.id > 0x7FF) {
        msg.format = CANExtended;
        }

        if (!can_write(&fdcan_1, msg))
        {
          can_reset(&fdcan_1);
        }
    } else {
      dbg_printf("fdcan1_handler: error invalid opcode (:%d)\n", opcode);
    }
}

void fdcan2_handler(uint8_t opcode, uint8_t *data, uint16_t size) {
    if (opcode == CONFIGURE)
    {
      uint32_t const can_bitrate = *((uint32_t *)data);
      can_frequency(&fdcan_2, can_bitrate);
      dbg_printf("fdcan2_handler: configuring fdcan2 with frequency %ld\n", can_bitrate);
    }
    else if (opcode == CAN_FILTER)
    {
        uint32_t const * info = (uint32_t*)data;

        uint32_t const handle = info[0];
        uint32_t const id     = info[1];
        uint32_t const mask   = info[2];

        CANFormat const format = (id < 0x800) ? CANStandard : CANExtended;

        if (!can_filter(&fdcan_2, id, mask, format, handle)) {
          dbg_printf("fdcan2_handler: can_filter failed for id: %ld, mask: %ld, format: %d, handle %ld\n", id, mask, format, handle);
        }
    }
    else if (opcode == CAN_TX_FRAME) {
        CAN_Message msg;
        msg.type = CANData;
        msg.format = CANStandard;
        memcpy(&msg, data, size);

        dbg_printf("Sending CAN message to %x, size %d, content[0]=0x%02X\n",
        msg.id, msg.len, msg.data[0]);

        if (msg.id > 0x7FF) {
        msg.format = CANExtended;
        }

        if (!can_write(&fdcan_2, msg))
        {
          can_reset(&fdcan_2);
        }
    } else {
      dbg_printf("fdcan2_handler: error invalid opcode (:%d)\n", opcode);
    }
}


void canInit()
{
    can_init_freq_direct(&fdcan_1, CAN_1, 800000);
    can_init_freq_direct(&fdcan_2, CAN_2, 800000);

    register_peripheral_callback(PERIPH_FDCAN1, &fdcan1_handler);
    register_peripheral_callback(PERIPH_FDCAN2, &fdcan2_handler);

