arduino/portentax8-stm32h7-fw/src/can.c
void can_irq_init(can_t *obj, can_irq_handler handler, uintptr_t context)
{
    irq_handler = handler;
    can_irq_contexts[obj->index] = context;
}

void can_irq_free(can_t *obj)
{
    CANName can = (CANName)obj->CanHandle.Instance;
    if (can == CAN_1) {
        HAL_NVIC_DisableIRQ(FDCAN1_IT0_IRQn);
        HAL_NVIC_DisableIRQ(FDCAN1_IT1_IRQn);
    }
#if defined(FDCAN2_BASE)
    else if (can == CAN_2) {
        HAL_NVIC_DisableIRQ(FDCAN2_IT0_IRQn);
        HAL_NVIC_DisableIRQ(FDCAN2_IT1_IRQn);
    }
#endif
#if defined(FDCAN3_BASE)
    else if (can == CAN_3) {
        HAL_NVIC_DisableIRQ(FDCAN3_IT0_IRQn);
        HAL_NVIC_DisableIRQ(FDCAN3_IT1_IRQn);
    }
#endif
    else {
        return;
    }
#if (defined TARGET_STM32H7)
    HAL_NVIC_DisableIRQ(FDCAN_CAL_IRQn);
#endif
    can_irq_contexts[obj->index] = 0;
}

void can_free(can_t *obj)
{
#if defined(DUAL_CORE) && (TARGET_STM32H7)
    while (LL_HSEM_1StepLock(HSEM, CFG_HW_RCC_SEMID)) {
    }
#endif /* DUAL_CORE */
#if defined(__HAL_RCC_FDCAN1_FORCE_RESET)
    __HAL_RCC_FDCAN1_FORCE_RESET();
    __HAL_RCC_FDCAN1_RELEASE_RESET();
#else
    __HAL_RCC_FDCAN_FORCE_RESET();
    __HAL_RCC_FDCAN_RELEASE_RESET();
#endif
#if defined(DUAL_CORE) && (TARGET_STM32H7)
    LL_HSEM_ReleaseLock(HSEM, CFG_HW_RCC_SEMID, HSEM_CR_COREID_CURRENT);
#endif /* DUAL_CORE */
#if defined(__HAL_RCC_FDCAN1_CLK_DISABLE)
    __HAL_RCC_FDCAN1_CLK_DISABLE();
#else
    __HAL_RCC_FDCAN_CLK_DISABLE();
#endif
}


/** Reset CAN interface.
 *
 * To use after error overflow.
 */
void can_reset(can_t *obj)
{
    can_mode(obj, MODE_RESET);
    HAL_FDCAN_ResetTimeoutCounter(&obj->CanHandle);
    HAL_FDCAN_ResetTimestampCounter(&obj->CanHandle);
}


int can_frequency(can_t *obj, int f)
{
    if (HAL_FDCAN_Stop(&obj->CanHandle) != HAL_OK) {
        error("HAL_FDCAN_Stop error\n");
    }


    /* See can_init_freq function for calculation details
     *
     * !Attention Not all bitrates can be covered with all fdcan-core-clk values. When a clk
     * does not work for the desired bitrate, change system_clock settings for FDCAN_CLK
     * (default FDCAN_CLK is PLLQ)
     */

#if (defined RCC_PERIPHCLK_FDCAN1)
    int ntq = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_FDCAN1) / f;
#else
    int ntq = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_FDCAN) / f;
#endif

    int nominalPrescaler = 1;
    // !When the sample point should be lower than 50%, this must be changed to
    // !IS_FDCAN_DATA_TSEG2(ntq/nominalPrescaler), since
    // NTSEG2 and SJW max values are lower. For now the sample point is fix @75%
    while (!IS_FDCAN_DATA_TSEG1(ntq / nominalPrescaler)) {
        nominalPrescaler ++;
        if (!IS_FDCAN_NOMINAL_PRESCALER(nominalPrescaler)) {
            error("Could not determine good nominalPrescaler. Bad clock value\n");
        }
    }
    ntq = ntq / nominalPrescaler;

    obj->CanHandle.Init.NominalPrescaler = nominalPrescaler;
    obj->CanHandle.Init.NominalTimeSeg1 = ntq * 0.75;      // Phase_segment_1
    obj->CanHandle.Init.NominalTimeSeg2 = ntq - 1 - obj->CanHandle.Init.NominalTimeSeg1;      // Phase_segment_2
    obj->CanHandle.Init.NominalSyncJumpWidth = obj->CanHandle.Init.NominalTimeSeg2; // Synchronization_Jump_width

    return can_internal_init(obj);
}


/** Filter out incoming messages
 *
 *  @param obj CAN object
 *  @param id the id to filter on
 *  @param mask the mask applied to the id
 *  @param format format to filter on
 *  @param handle message filter handle (not supported yet)
 *
 *  @returns
 *    0 if filter change failed or unsupported,
 *    new filter handle if successful (not supported yet => returns 1)
 */
int can_filter(can_t *obj, uint32_t id, uint32_t mask, CANFormat format, int32_t handle)
{
    FDCAN_FilterTypeDef sFilterConfig = {0};

    if (format == CANStandard) {
        sFilterConfig.IdType = FDCAN_STANDARD_ID;
        sFilterConfig.FilterIndex = handle;
        sFilterConfig.FilterType = FDCAN_FILTER_MASK;
        sFilterConfig.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
        sFilterConfig.FilterID1 = id;
        sFilterConfig.FilterID2 = mask;
    } else if (format == CANExtended) {
        sFilterConfig.IdType = FDCAN_EXTENDED_ID;
        sFilterConfig.FilterIndex = handle;
        sFilterConfig.FilterType = FDCAN_FILTER_MASK;
        sFilterConfig.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
        sFilterConfig.FilterID1 = id;
        sFilterConfig.FilterID2 = mask;
    } else { // Filter for CANAny format cannot be configured for STM32
        return 0;
    }

    if (HAL_FDCAN_ConfigFilter(&obj->CanHandle, &sFilterConfig) != HAL_OK) {
        return 0;
    }

    return 1;
}


int can_write(can_t *obj, CAN_Message msg)
{
    FDCAN_TxHeaderTypeDef TxHeader = {0};

    // Configure Tx buffer message
    TxHeader.Identifier = msg.id;
    if (msg.format == CANStandard) {
        TxHeader.IdType = FDCAN_STANDARD_ID;
    } else {
        TxHeader.IdType = FDCAN_EXTENDED_ID;
    }

    TxHeader.TxFrameType = FDCAN_DATA_FRAME;
    switch (msg.len)
    {
      default:
      case 0:  TxHeader.DataLength = FDCAN_DLC_BYTES_0;  break;
      case 1:  TxHeader.DataLength = FDCAN_DLC_BYTES_1;  break;
      case 2:  TxHeader.DataLength = FDCAN_DLC_BYTES_2;  break;
      case 3:  TxHeader.DataLength = FDCAN_DLC_BYTES_3;  break;
      case 4:  TxHeader.DataLength = FDCAN_DLC_BYTES_4;  break;
      case 5:  TxHeader.DataLength = FDCAN_DLC_BYTES_5;  break;
      case 6:  TxHeader.DataLength = FDCAN_DLC_BYTES_6;  break;
      case 7:  TxHeader.DataLength = FDCAN_DLC_BYTES_7;  break;
      case 8:  TxHeader.DataLength = FDCAN_DLC_BYTES_8;  break;
      case 12: TxHeader.DataLength = FDCAN_DLC_BYTES_12; break;
      case 16: TxHeader.DataLength = FDCAN_DLC_BYTES_16; break;
      case 20: TxHeader.DataLength = FDCAN_DLC_BYTES_20; break;
      case 24: TxHeader.DataLength = FDCAN_DLC_BYTES_24; break;
      case 32: TxHeader.DataLength = FDCAN_DLC_BYTES_32; break;
      case 48: TxHeader.DataLength = FDCAN_DLC_BYTES_48; break;
      case 64: TxHeader.DataLength = FDCAN_DLC_BYTES_64; break;
    }
    TxHeader.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
    TxHeader.BitRateSwitch = FDCAN_BRS_OFF;
    TxHeader.FDFormat = FDCAN_CLASSIC_CAN;
    TxHeader.TxEventFifoControl = FDCAN_STORE_TX_EVENTS;
    TxHeader.MessageMarker = 0;

    if (HAL_FDCAN_AddMessageToTxFifoQ(&obj->CanHandle, &TxHeader, msg.data) != HAL_OK)
    {
      uint32_t const err_code = HAL_FDCAN_GetError(&obj->CanHandle);
      printf("error: %ld\n", err_code);

      uint8_t msg[2] = {X8H7_CAN_STS_INT_ERR, 0};
      if (err_code == HAL_FDCAN_ERROR_FIFO_FULL) msg[1] = X8H7_CAN_STS_FLG_TX_OVR;

