arduino/portentax8-stm32h7-fw/src/can.c
      enqueue_packet(obj == &fdcan_1 ? PERIPH_FDCAN1 : PERIPH_FDCAN2, CAN_STATUS, sizeof(msg), msg);
      return 0;
    }
    else
    {
      uint8_t msg[2] = {X8H7_CAN_STS_INT_TX, 0};
      enqueue_packet(obj == &fdcan_1 ? PERIPH_FDCAN1 : PERIPH_FDCAN2, CAN_STATUS, sizeof(msg), msg);
      return 1;
    }
}

int can_read(can_t *obj, CAN_Message *msg)
{
    if (HAL_FDCAN_GetRxFifoFillLevel(&obj->CanHandle, FDCAN_RX_FIFO0) == 0) {
        return 0; // No message arrived
    }

    FDCAN_RxHeaderTypeDef RxHeader = {0};
    if (HAL_FDCAN_GetRxMessage(&obj->CanHandle, FDCAN_RX_FIFO0, &RxHeader, msg->data) != HAL_OK) {
        error("HAL_FDCAN_GetRxMessage error\n"); // Should not occur as previous HAL_FDCAN_GetRxFifoFillLevel call reported some data
        return 0;
    }

    if (RxHeader.IdType == FDCAN_STANDARD_ID) {
        msg->format = CANStandard;
    } else {
        msg->format = CANExtended;
    }
    msg->id   = RxHeader.Identifier;
    msg->type = (RxHeader.RxFrameType == FDCAN_DATA_FRAME) ? CANData : CANRemote;
    msg->len  = RxHeader.DataLength >> 16; // see FDCAN_data_length_code value

    return 1;
}

unsigned char can_rderror(can_t *obj)
{
    FDCAN_ErrorCountersTypeDef ErrorCounters;

    HAL_FDCAN_GetErrorCounters(&obj->CanHandle, &ErrorCounters);

    return (unsigned char)ErrorCounters.RxErrorCnt;
}

unsigned char can_tderror(can_t *obj)
{
    FDCAN_ErrorCountersTypeDef ErrorCounters;

    HAL_FDCAN_GetErrorCounters(&obj->CanHandle, &ErrorCounters);

    return (unsigned char)ErrorCounters.TxErrorCnt;
}

void can_monitor(can_t *obj, int silent)
{
    CanMode mode = MODE_NORMAL;
    if (silent) {
        switch (obj->CanHandle.Init.Mode) {
            case FDCAN_MODE_INTERNAL_LOOPBACK:
                mode = MODE_TEST_SILENT;
                break;
            default:
                mode = MODE_SILENT;
                break;
        }
    } else {
        switch (obj->CanHandle.Init.Mode) {
            case FDCAN_MODE_INTERNAL_LOOPBACK:
            case FDCAN_MODE_EXTERNAL_LOOPBACK:
                mode = MODE_TEST_LOCAL;
                break;
            default:
                mode = MODE_NORMAL;
                break;
        }
    }

    can_mode(obj, mode);
}

/** Change CAN operation to the specified mode
 *
 *  @param mode The new operation mode (MODE_RESET, MODE_NORMAL, MODE_SILENT, MODE_TEST_LOCAL, MODE_TEST_GLOBAL, MODE_TEST_SILENT)
 *
 *  @returns
 *    0 if mode change failed or unsupported,
 *    1 if mode change was successful
 */
int can_mode(can_t *obj, CanMode mode)
{
    if (HAL_FDCAN_Stop(&obj->CanHandle) != HAL_OK) {
        error("HAL_FDCAN_Stop error\n");
    }

    switch (mode) {
        case MODE_RESET:
            break;
        case MODE_NORMAL:
            obj->CanHandle.Init.Mode = FDCAN_MODE_NORMAL;
            // obj->CanHandle.Init.NominalPrescaler = 100;   // Prescaler
            break;
        case MODE_SILENT: // Bus Monitoring
            obj->CanHandle.Init.Mode = FDCAN_MODE_BUS_MONITORING;
            break;
        case MODE_TEST_GLOBAL: // External LoopBack
        case MODE_TEST_LOCAL:
            obj->CanHandle.Init.Mode = FDCAN_MODE_EXTERNAL_LOOPBACK;
            break;
        case MODE_TEST_SILENT: // Internal LoopBack
            obj->CanHandle.Init.Mode = FDCAN_MODE_INTERNAL_LOOPBACK;
            // obj->CanHandle.Init.NominalPrescaler = 1;   // Prescaler
            break;
        default:
            return 0;
    }

    return can_internal_init(obj);
}

#if 0
static void can_irq(CANName name, int id)
{
    FDCAN_HandleTypeDef CanHandle;
    CanHandle.Instance = (FDCAN_GlobalTypeDef *)name;

    if (__HAL_FDCAN_GET_IT_SOURCE(&CanHandle, FDCAN_IT_TX_COMPLETE)) {
        if (__HAL_FDCAN_GET_FLAG(&CanHandle, FDCAN_FLAG_TX_COMPLETE)) {
            __HAL_FDCAN_CLEAR_FLAG(&CanHandle, FDCAN_FLAG_TX_COMPLETE);
            irq_handler(can_irq_contexts[id], IRQ_TX);
        }
    }
#if (defined FDCAN_IT_RX_BUFFER_NEW_MESSAGE)
    if (__HAL_FDCAN_GET_IT_SOURCE(&CanHandle, FDCAN_IT_RX_BUFFER_NEW_MESSAGE)) {
        if (__HAL_FDCAN_GET_FLAG(&CanHandle, FDCAN_IT_RX_BUFFER_NEW_MESSAGE)) {
            __HAL_FDCAN_CLEAR_FLAG(&CanHandle, FDCAN_IT_RX_BUFFER_NEW_MESSAGE);
            irq_handler(can_irq_contexts[id], IRQ_RX);
        }
    }
#else
    if (__HAL_FDCAN_GET_IT_SOURCE(&CanHandle, FDCAN_IT_RX_FIFO0_NEW_MESSAGE)) {
        if (__HAL_FDCAN_GET_FLAG(&CanHandle, FDCAN_IT_RX_FIFO0_NEW_MESSAGE)) {
            __HAL_FDCAN_CLEAR_FLAG(&CanHandle, FDCAN_IT_RX_FIFO0_NEW_MESSAGE);
            irq_handler(can_irq_contexts[id], IRQ_RX);
        }
    }
#endif
    if (__HAL_FDCAN_GET_IT_SOURCE(&CanHandle, FDCAN_IT_ERROR_WARNING)) {
        if (__HAL_FDCAN_GET_FLAG(&CanHandle, FDCAN_FLAG_ERROR_WARNING)) {
            __HAL_FDCAN_CLEAR_FLAG(&CanHandle, FDCAN_FLAG_ERROR_WARNING);
            irq_handler(can_irq_contexts[id], IRQ_ERROR);
        }
    }

    if (__HAL_FDCAN_GET_IT_SOURCE(&CanHandle, FDCAN_IT_ERROR_PASSIVE)) {
        if (__HAL_FDCAN_GET_FLAG(&CanHandle, FDCAN_FLAG_ERROR_PASSIVE)) {
            __HAL_FDCAN_CLEAR_FLAG(&CanHandle, FDCAN_FLAG_ERROR_PASSIVE);
            irq_handler(can_irq_contexts[id], IRQ_PASSIVE);
        }
    }

    if (__HAL_FDCAN_GET_IT_SOURCE(&CanHandle, FDCAN_IT_BUS_OFF)) {
        if (__HAL_FDCAN_GET_FLAG(&CanHandle, FDCAN_FLAG_BUS_OFF)) {
            __HAL_FDCAN_CLEAR_FLAG(&CanHandle, FDCAN_FLAG_BUS_OFF);
            irq_handler(can_irq_contexts[id], IRQ_BUS);
        }
    }
}
#endif

#if 0
void FDCAN1_IT0_IRQHandler(void)
{
    can_irq(CAN_1, 0);
}

void FDCAN1_IT1_IRQHandler(void)
{
    can_irq(CAN_1, 0);
}

#if defined(FDCAN2_BASE)
void FDCAN2_IT0_IRQHandler(void)
{
    can_irq(CAN_2, 1);
}

void FDCAN2_IT1_IRQHandler(void)
{
    can_irq(CAN_2, 1);
}
#endif //FDCAN2_BASE

#if defined(FDCAN3_BASE)
void FDCAN3_IT0_IRQHandler(void)
{
    can_irq(CAN_3, 2);
}

void FDCAN3_IT1_IRQHandler(void)
{
    can_irq(CAN_3, 2);
}
#endif //FDCAN3_BASE
#endif

// TODO Add other interrupts ?
void can_irq_set(can_t *obj, CanIrqType type, uint32_t enable)
{
    uint32_t interrupts = 0;

    switch (type) {
        case IRQ_TX:
            interrupts = FDCAN_IT_TX_COMPLETE;
            break;
        case IRQ_RX:
#if (defined FDCAN_IT_RX_BUFFER_NEW_MESSAGE)
            interrupts = FDCAN_IT_RX_BUFFER_NEW_MESSAGE;
#else
            interrupts = FDCAN_IT_RX_FIFO0_NEW_MESSAGE;
#endif
            break;
        case IRQ_ERROR:
            interrupts = FDCAN_IT_ERROR_WARNING;
            break;
        case IRQ_PASSIVE:
            interrupts = FDCAN_IT_ERROR_PASSIVE;
            break;
        case IRQ_BUS:
            interrupts = FDCAN_IT_BUS_OFF;
        default:
            return;
    }

    if (enable) {
        /* The TXBTIE register controls the TX complete interrupt in FDCAN 
         * and is only used in case of TX interrupts, Hence in case of enabling the 
         * TX interrupts the bufferIndexes of TXBTIE are to be set  */
#ifdef TARGET_STM32H7
        // TXBTIE for STM32H7 is 2 bytes long
        HAL_FDCAN_ActivateNotification(&obj->CanHandle, interrupts, 0xFFFF);
#else
        //TXBTIE for rest supported FDCAN Platforms(STM32G0x1, STM32G4 and STM32L5) is 3 bits.
        HAL_FDCAN_ActivateNotification(&obj->CanHandle, interrupts, 0x07);
#endif
    } else {
        HAL_FDCAN_DeactivateNotification(&obj->CanHandle, interrupts);
    }

#if 0
    NVIC_SetVector(FDCAN1_IT0_IRQn, (uint32_t)&FDCAN1_IT0_IRQHandler);
    NVIC_EnableIRQ(FDCAN1_IT0_IRQn);
    NVIC_SetVector(FDCAN1_IT1_IRQn, (uint32_t)&FDCAN1_IT1_IRQHandler);
    NVIC_EnableIRQ(FDCAN1_IT1_IRQn);
#if defined(FDCAN2_BASE)
    NVIC_SetVector(FDCAN2_IT0_IRQn, (uint32_t)&FDCAN2_IT0_IRQHandler);
    NVIC_EnableIRQ(FDCAN2_IT0_IRQn);
    NVIC_SetVector(FDCAN2_IT1_IRQn, (uint32_t)&FDCAN2_IT1_IRQHandler);
    NVIC_EnableIRQ(FDCAN2_IT1_IRQn);
#endif
#if defined(FDCAN3_BASE)
    NVIC_SetVector(FDCAN3_IT0_IRQn, (uint32_t)&FDCAN3_IT0_IRQHandler);
    NVIC_EnableIRQ(FDCAN3_IT0_IRQn);
    NVIC_SetVector(FDCAN3_IT1_IRQn, (uint32_t)&FDCAN3_IT1_IRQHandler);
    NVIC_EnableIRQ(FDCAN3_IT1_IRQn);
#endif
#endif
}
